Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: {: .callout .tip} **Tip:** It is very common to start with a catch-all expectation for a method and `Times(AnyNumber())` (omitting arguments, or with `_` for all arguments, if overloaded).
it_it: {: .callout .tip} **Tip:** È molto comune iniziare con una expectation generale per un metodo e con `Times(AnyNumber())` (omettendo gli argomenti, o con `_` per tutti gli argomenti, se [overloaded] sovraccaricati).

source: {: .callout .tip} **Tip:** The `Mock::VerifyAndClearExpectations()` function returns a `bool` to indicate whether the verification was successful (`true` for yes), so you can wrap that function call inside a `ASSERT_TRUE()` if there is no point going further when the verification has failed.
it_it: {: .callout .tip} **Tip:** La funzione `Mock::VerifyAndClearExpectations()` restituisce un `bool` per indicare se la verifica ha avuto esito positivo (`true` per sì), quindi si può racchiudere la chiamata alla funzione all'interno di `ASSERT_TRUE()` se non ha senso andare oltre in caso quando la verifica non è riuscita.

source: {: .callout .tip} TIP: You can easily count the number of disabled tests you have using `grep`.
it_it: {: .callout .tip} TIP: Si può facilmente contare il numero di test disabilitati con `grep`.

source: {: .callout .tip} Tip: for convenience, `MatchAndExplain()` can take a `MatchResultListener*` instead of `std::ostream*`.
it_it: {: .callout .tip} Tip: per comodità, `MatchAndExplain()` può accettare un `MatchResultListener*` invece di `std::ostream*`.

source: {: .callout .warning} WARNING: Equality matching via EXPECT_THAT(actual_value, expected_value) is supported, however note that implicit conversions can cause surprising results.
it_it: {: .callout .warning} WARNING: È supportata la corrispondenza dell'uguaglianza tramite EXPECT_THAT(actual_value, expected_value), tuttavia si tenga presente che le conversioni implicite possono causare risultati sorprendenti.

source: {: .callout .warning} WARNING: A fatal assertion in a helper function (private void-returning method) called from a constructor or destructor does not terminate the current test, as your intuition might suggest: it merely returns from the constructor or destructor early, possibly leaving your object in a partially-constructed or partially-destructed state!
it_it: {: .callout .warning} ATTENZIONE: Un'asserzione fatale in una funzione helper (metodo privato che restituisce void) chiamata da un costruttore o da un distruttore non termina il test corrente, come potrebbe suggerire l'intuito: ritorna semplicemente dal costruttore o anticipatamente dal distruttore, forse lasciando l'oggetto in uno stato di parzialmente creato o di parzialmente distrutto!

source: {: .callout .warning} WARNING: gMock does not guarantee when or how many times a matcher will be invoked.
it_it: {: .callout .warning} ATTENZIONE: gMock non garantisce quando o quante volte un matcher verrà invocato.

source: {: .callout .warning} **WARNING:** Equality matching via `EXPECT_THAT(actual_value, expected_value)` is supported, however note that implicit conversions can cause surprising results.
it_it: {: .callout .warning} **WARNING:** È supportata la corrispondenza dell'uguaglianza tramite `EXPECT_THAT(actual_value, expected_value)`, tuttavia si tenga presente che le conversioni implicite possono causare risultati sorprendenti.

source: } } // A death assertion can contain a compound statement.
it_it: } } // Un'asserzione death può contenere un'istruzione composta.

source: } }; // Tests for SkipFixture won't be executed.
it_it: } }; // I test per SkipFixture non verranno eseguiti.

source: }; // Or, when you want to add parameters to a pre-existing fixture class: class BaseTest : public testing::Test {
it_it: }; // Oppure, quando si desidera aggiungere parametri a una classe fixture pre-esistente: class BaseTest : public testing::Test {

source: }; // Tests that the Foo::Bar() method does Abc.
it_it: }; // Verifica che il metodo Foo::Bar() esegua Abc.

source: ~Base() will be called, but ~Derived() will not
it_it: verrà chiamato ~Base(), ma non ~Derived()
